Smoothness Property
 The smoothness of the material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int Smoothness { get; set; }
Visual Basic
Public Property Smoothness As Integer
	Get
	Set
Visual C++
public:
property int Smoothness {
	int get ();
	void set (int value);
}
Field Value
 The value ranges from 0 to 100.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  When setting this property: values for shininess must be between 0 and 128
See Also
Material Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →